Repository: Mu-L/Off-Day
Catalog: Off Day/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hk

source: Action Done
ja: 操作完了
ko: 작업 완료
zh_hans: 操作完成
zh_hk: 操作完成

# backup.alert.folderName.message
source: It is recommended to input Arabic numerals or English letters.
ja: 半角英数字の使用を推奨します。
ko: 아라비아 숫자 또는 영문자 입력을 권장합니다.
zh_hans: 建议使用英文字母和阿拉伯数字
zh_hk: 建議使用英文字母和阿拉伯數字

# backup.alert.folderName.title
source: Enter Folder Name
ja: フォルダ名を入力
ko: 폴더 이름 입력
zh_hans: 输入自定义文件夹名
zh_hk: 輸入自定義文件夾名

# backup.alert.import.title
source: Importing the database will delete all existing data.
ja: データベースのインポートにより、既存データがすべて削除されます。
ko: 데이터베이스를 가져오면 기존 데이터가 모두 삭제됩니다.
zh_hans: 导入数据库将会删除所有现有数据
zh_hk: 導入數據庫將會刪除所有現有數據

# backup.alert.result.failed
source: Operation failed
ja: 操作に失敗しました
ko: 작업 실패
zh_hans: 操作失败
zh_hk: 操作失敗

# backup.alert.result.success
source: Operation completed
ja: 操作完了
ko: 작업 완료
zh_hans: 操作完成
zh_hk: 操作完成

# backup.history.none
source: None
ja: なし
ko: 없음
zh_hans: 无
zh_hk: 無

# backup.item.database.export
source: Export Database File
ja: データベースファイルをエクスポート
ko: 데이터베이스 파일 내보내기
zh_hans: 导出数据库文件
zh_hk: 導出數據庫文件

# backup.item.database.import
source: Import Database File
ja: データベースファイルをインポート
ko: 데이터베이스 파일 가져오기
zh_hans: 导入数据库文件
zh_hk: 導入數據庫文件

# backup.item.status.backupNow
source: Backup Now
ja: 今すぐバックアップ
ko: 지금 백업
zh_hans: 立即备份
zh_hk: 立即備份

# backup.item.status.folderName
source: Folder Name
ja: フォルダ名
ko: 폴더 이름
zh_hans: 文件夹名
zh_hk: 文件夾名

# backup.item.status.latest
source: Latest Backup
ja: 最終バックアップ
ko: 최근 백업
zh_hans: 最近备份
zh_hk: 最近備份

# backup.item.switch
source: Auto Backup
ja: 自動バックアップ
ko: 자동 백업
zh_hans: 自动备份
zh_hk: 自動備份

# backup.section.database.hint
source: Importing the database will delete all existing data.
ja: データベースのインポートにより、既存データがすべて削除されます。
ko: 데이터베이스를 가져오면 기존 데이터가 모두 삭제됩니다.
zh_hans: 导入数据库将会删除所有现有数据。
zh_hk: 導入數據庫將會刪除所有現有數據。

# backup.section.database.title
source: Database
ja: データベース
ko: 데이터베이스
zh_hans: 数据库
zh_hk: 數據庫

# backup.section.summary.title
source: iCloud Backup Summary
ja: iCloudバックアップ情報
ko: iCloud 백업 요약
zh_hans: iCloud备份信息
zh_hk: iCloud備份信息

# backup.section.toggle.hint
source: The database file will be automatically backed up to the 'Off Day' folder in iCloud. Up to once per day.
ja: データベースファイルはiCloudの「Off Day」フォルダに自動的にバックアップされます。1日1回まで。
ko: 데이터베이스 파일은 iCloud의 'Off Day' 폴더에 자동으로 백업됩니다. 하루 최대 한 번 실행됩니다.
zh_hans: 数据库文件将会自动同步到iCloud里的'Off Day'文件夹。每天最多备份一次。
zh_hk: 數據庫文件將會自動同步到iCloud裡的'Off Day'文件夾。每天最多備份一次。

# backup.section.toggle.hint2
source: This function required iCloud Drive access.
ja: この機能にはiCloud Driveへのアクセスが必要です。
ko: 이 기능에는 iCloud Drive 접근 권한이 필요합니다.
zh_hans: 此功能需要iCloud云盘访问权限。
zh_hk: 此功能需要iCloud雲碟訪問權限。

# backup.title
source: Backup
ja: バックアップ
ko: 백업
zh_hans: 备份
zh_hk: 備份

# baseCalendar.days.day%i
source: %i Days
ja: %i日
ko: %i일
zh_hans: %i天
zh_hk: %i天

# baseCalendar.days.off
source: Rest for
ja: あと
ko: 휴무
zh_hans: 再休息
zh_hk: 再休息

# baseCalendar.days.start
source: Circle Starts at
ja: サイクル開始日
ko: 주기 시작일
zh_hans: 循环开始于
zh_hk: 循環開始於

# baseCalendar.days.work
source: Work for
ja: 出勤
ko: 근무
zh_hans: 先工作
zh_hk: 先工作

# baseCalendar.main.header
source: Off Day Type
ja: 休日タイプ
ko: 휴일 유형
zh_hans: 休息日类型
zh_hk: 休息日類型

# baseCalendar.standard.footer
source: The selected days of the week will be considered as Off Days
ja: 選択した曜日が休日として設定されます
ko: 선택한 요일은 휴일로 간주됩니다
zh_hans: 选中的日子将作为休息日
zh_hk: 選中的日子將作為休息日

# baseCalendar.type.days
source: Days Circle (Shift)
ja: 日数サイクル（シフト）
ko: 일수 주기(교대)
zh_hans: 多天循环（轮休/倒班）
zh_hk: 多日循環（輪休/倒班）

# baseCalendar.type.standard
source: Standard
ja: 固定休日
ko: 고정 휴일
zh_hans: 固定休息日
zh_hk: 固定休息日

# baseCalendar.type.weeks
source: Weeks Circle
ja: 週サイクル
ko: 주 단위 주기
zh_hans: 多周循环（大小周）
zh_hk: 多週循環（大小週）

# baseCalendar.weeks.2
source: 2 Weeks
ja: 2週
ko: 2주
zh_hans: 2周
zh_hk: 2週

# baseCalendar.weeks.3
source: 3 Weeks
ja: 3週
ko: 3주
zh_hans: 3周
zh_hk: 3週

# baseCalendar.weeks.4
source: 4 Weeks
ja: 4週
ko: 4주
zh_hans: 4周
zh_hk: 4週

# baseCalendar.weeks.5
source: 5 Weeks
ja: 5週
ko: 5주
zh_hans: 5周
zh_hk: 5週

# baseCalendar.weeks.6
source: 6 Weeks
ja: 6週
ko: 6주
zh_hans: 6周
zh_hk: 6週

# baseCalendar.weeks.7
source: 7 Weeks
ja: 7週
ko: 7주
zh_hans: 7周
zh_hk: 7週

# baseCalendar.weeks.8
source: 8 Weeks
ja: 8週
ko: 8주
zh_hans: 8周
zh_hk: 8週

# baseCalendar.weeks.9
source: 9 Weeks
ja: 9週
ko: 9주
zh_hans: 9周
zh_hk: 9週

# baseCalendar.weeks.10
source: 10 Weeks
ja: 10週
ko: 10주
zh_hans: 10周
zh_hk: 10週

# baseCalendar.weeks.count
source: Weeks Count
ja: サイクル週数
ko: 주기 주 수
zh_hans: 一次循环包含
zh_hk: 一次循環包含

# batchEditor.alert.message.normal%@,%@,%@
source: All user annotations from %1$@ to %2$@ will be %3$@.
ja: %1$@から %2$@までのユーザー注釈をすべて%3$@に変更します。
ko: %1$@부터 %2$@까지의 모든 사용자 주석이 %3$@(으)로 변경됩니다.
zh_hans: 从%1$@到%2$@的用户标注将全部更新为%3$@
zh_hk: 從%1$@到%2$@的用戶標註將全部更新為%3$@

# batchEditor.alert.message.toBlank%@,%@
source: All user annotations from %1$@ to %2$@ will be erased.
ja: %1$@から %2$@までのユーザー注釈をすべて消去します。
ko: %1$@부터 %2$@까지의 모든 사용자 주석이 지워집니다.
zh_hans: 从%1$@到%2$@的用户标注将全部删除，变为空白
zh_hk: 從%1$@到%2$@的用戶標註將全部刪除，變為空白

# batchEditor.alert.title
source: Warning: This action is irreversible.
ja: 警告：この操作は元に戻せません。
ko: 경고: 이 작업은 되돌릴 수 없습니다.
zh_hans: 此操作一旦执行将不可撤销
zh_hk: 此操作一旦執行將不可撤銷

# batchEditor.button.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# batchEditor.button.confirm
source: Execute
ja: 実行
ko: 실행
zh_hans: 执行
zh_hk: 執行

# batchEditor.button.update
source: Update
ja: 更新
ko: 업데이트
zh_hans: 更新
zh_hk: 更新

# batchEditor.cell.end
source: End Date
ja: 終了日
ko: 종료일
zh_hans: 结束日期
zh_hk: 結束日期

# batchEditor.cell.start
source: Start Date
ja: 開始日
ko: 시작일
zh_hans: 起始日期
zh_hk: 起始日期

# batchEditor.section.dayType.footer
source: Changes here will overwrite all user annotations in the selected date range. Proceed with caution.
ja: ここでの変更は選択した日付範囲内のすべてのユーザー注釈を上書きします。慎重に操作してください。
ko: 여기서 변경하면 선택한 날짜 범위의 모든 사용자 주석을 덮어씁니다. 신중하게 진행하세요.
zh_hans: 此处修改将会覆盖对应日期段里的全部用户标注，请谨慎修改。
zh_hk: 此處修改將會覆蓋對應日期段裡的全部用戶標註，請謹慎修改。

# batchEditor.section.time.footer
source: Up to 1000 days of records can be updated at once.
ja: 一度に最大1,000日分のレコードを更新できます。
ko: 한 번에 최대 1,000일의 기록을 업데이트할 수 있습니다.
zh_hans: 单次可以更新不超过1000天的记录。
zh_hk: 單次可以更新不超過1000天的記錄。

# batchEditor.title
source: Batch Editor
ja: 一括編集
ko: 일괄 편집
zh_hans: 批量编辑器
zh_hk: 批量編輯器

# button.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# button.close
source: Close
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hk: 關閉

# button.done
source: Done
ja: 完了
ko: 완료
zh_hans: 完成
zh_hk: 完成

# button.save
source: Save
ja: 保存
ko: 저장
zh_hans: 保存
zh_hk: 保存

# calendar.title.year.current
source: Current
ja: 今年
ko: 올해
zh_hans: 今年
zh_hk: 今年

# Check Clash Day
source: Clash Day
ja: 衝突日
ko: 충돌일
zh_hans: 冲突日
zh_hk: 衝突日

# Check Off Day
source: Off Day
ja: 休日
ko: 휴일
zh_hans: 休息日
zh_hk: 休息日

# chinese.calendar.leap
source: 闰
ja: 閏
ko: 윤
zh_hk: 閏

# comment.%@
source: User Text Comment: %@
ja: ユーザーテキストメモ：%@
ko: 사용자 텍스트 메모: %@
zh_hans: 用户文本备注：%@
zh_hk: 用戶文本備註：%@

# comment.add
source: Add Comment
ja: メモを追加
ko: 메모 추가
zh_hans: 添加备注
zh_hk: 添加備註

# comment.edit
source: Edit Comment
ja: メモを編集
ko: 메모 편집
zh_hans: 编辑备注
zh_hk: 編輯備註

# comment.empty
source: No Comment
ja: メモなし
ko: 메모 없음
zh_hans: 无备注
zh_hk: 無備註

# controller.baseCalendar.title
source: Base Calendar
ja: ベースカレンダー
ko: 기본 캘린더
zh_hans: 基础日历
zh_hk: 基礎日曆

# controller.calendar.batchEditor
source: Batch User Annotations
ja: ユーザー注釈を一括設定
ko: 사용자 주석 일괄 설정
zh_hans: 批量设置用户标注
zh_hk: 批量設置用戶標註

# controller.calendar.noPublicPlan
source: No Public Holiday Template
ja: 祝日テンプレートなし
ko: 공휴일 템플릿 없음
zh_hans: 无公共假期模板
zh_hk: 無公共假期模板

# controller.calendar.title
source: Calendar
ja: カレンダー
ko: 캘린더
zh_hans: 日历
zh_hk: 日曆

# controller.log.title
source: Log
ja: ログ
ko: 로그
zh_hans: 日志
zh_hk: 日誌

# controller.more.title
source: More
ja: その他
ko: 더 보기
zh_hans: 更多
zh_hk: 更多

# controller.publicDay.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# controller.publicDay.confirm
source: Save
ja: 保存
ko: 저장
zh_hans: 保存
zh_hk: 保存

# controller.publicDay.title
source: Public Holiday Template
ja: 祝日テンプレート
ko: 공휴일 템플릿
zh_hans: 公共假期模板
zh_hk: 公共假期模板

# controller.tutorials.title
source: Tutorials
ja: チュートリアル
ko: 튜토리얼
zh_hans: 教程
zh_hk: 教程

source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hk: 日期

source: Day Count
ja: 日数
ko: 일수
zh_hans: 天数
zh_hk: 日數

# dayDetail.%@%@%@%@%@%@
source: %2$@This day is %1$@, Base Calendar day type: %3$@, Public Holiday day type: %4$@, Custom day type: %5$@, %6$@
ja: %2$@この日は%1$@、ベースカレンダー：%3$@、祝日：%4$@、カスタム：%5$@、%6$@
ko: %2$@이 날짜는 %1$@입니다. 기본 캘린더 날짜 유형: %3$@, 공휴일 날짜 유형: %4$@, 사용자 지정 날짜 유형: %5$@, %6$@
zh_hans: %2$@这一天是：%1$@，基础日历信息：%3$@，公共假期信息：%4$@，用户自定义信息：%5$@，%6$@
zh_hk: %2$@這一天是：%1$@，基礎日曆信息：%3$@，公共假期信息：%4$@，用戶自定義信息：%5$@，%6$@

# dayDetail.noInformation
source: Null
ja: 情報なし
ko: 정보 없음
zh_hans: 无信息
zh_hk: 無信息

# dayEditor.comment
source: Comment
ja: メモ
ko: 메모
zh_hans: 备注
zh_hk: 備註

# dayEditor.placeholder.comment
source: The text length should be within 1-200 characters.
ja: 1〜200文字で入力してください。
ko: 텍스트 길이는 1~200자 이내여야 합니다.
zh_hans: 文字长度在1-200范围内
zh_hk: 文字長度在1-200範圍內

# dayType.none
source: Blank
ja: 空白
ko: 공백
zh_hans: 空白
zh_hk: 空白

# dayType.offDay.title
source: Off Day
ja: 休日
ko: 휴일
zh_hans: 休息日
zh_hk: 休息日

# dayType.title
source: Day Type
ja: 日付タイプ
ko: 날짜 유형
zh_hans: 休息日类型
zh_hk: 休息日類型

# dayType.workDay.title
source: Work Day
ja: 出勤日
ko: 근무일
zh_hans: 工作日
zh_hk: 工作日

# detail.comment.hint
source: Add Comment
ja: メモを追加
ko: 메모 추가
zh_hans: 添加备注
zh_hk: 添加備註

# detail.custom
source: Custom as
ja: カスタム設定
ko: 사용자 지정
zh_hans: 标记为
zh_hk: 標記為

# detail.day.off.hint
source: Double-click to select or deselect, only one of the Off Day and Work Day options can be selected at a time.
ja: ダブルタップで選択・解除。休日と出勤日はどちらか一方のみ選択できます。
ko: 두 번 탭하여 선택하거나 선택 해제할 수 있으며, 휴일과 근무일 옵션 중 하나만 선택할 수 있습니다.
zh_hans: 双击选中或取消选中，“休息日”选项和“工作日”选项最多只会有一个被选中。
zh_hk: 雙擊選中或取消選中，“休息日”選項和“工作日”選項最多隻會有一個被選中。

# detail.day.off.title
source: Off Day
ja: 休日
ko: 휴일
zh_hans: 休息日
zh_hk: 休息日

# detail.day.work.hint
source: Double-click to select or deselect, only one of the Off Day and Work Day options can be selected at a time.
ja: ダブルタップで選択・解除。休日と出勤日はどちらか一方のみ選択できます。
ko: 두 번 탭하여 선택하거나 선택 해제할 수 있으며, 휴일과 근무일 옵션 중 하나만 선택할 수 있습니다.
zh_hans: 双击选中或取消选中，“休息日”选项和“工作日”选项最多只会有一个被选中。
zh_hk: 雙擊選中或取消選中，“休息日”選項和“工作日”選項最多隻會有一個被選中。

# detail.day.work.title
source: Work Day
ja: 出勤日
ko: 근무일
zh_hans: 工作日
zh_hk: 工作日

source: From which day onward?
ja: どの日以降？
ko: 어느 날부터?
zh_hans: 从哪天往后查找？
zh_hk: 從哪天往後查找？

source: Get Day Detail of ${date}
ja: ${date}の詳細を取得
ko: ${date}의 날짜 상세 정보 가져오기
zh_hans: 获取 ${date} 的详情
zh_hk: 獲取 ${date} 的詳情

source: If the result is true, it is a Clash Day. Clash Day means that the public holiday template, base calendar, and user annotations (optional) for this day have different criteria for determining whether it is an Off Day.
ja: 結果がtrueの場合は衝突日です。衝突日とは、この日の祝日テンプレート・ベースカレンダー・ユーザー注釈（任意）で休日かどうかの判断が異なることを意味します。
ko: 결과가 true이면 충돌일입니다. 충돌일은 해당 날짜가 휴일인지 판단하는 기준이 공휴일 템플릿, 기본 캘린더, 사용자 주석(선택 사항) 사이에서 서로 다른 경우를 의미합니다.
zh_hans: 如果结果为 true 则是冲突日。冲突日意味着这一天的用户标注信息（可选）、公共假期模板以及基础日历对于“这一天是否是休息日”的判断是不同的。
zh_hk: 如果結果為 true 則是衝突日。衝突日意味着這一日的用戶標註信息（可選）、公共假期模板以及基礎日曆對於“這一日是否是休息日”的判斷是不同的。

source: If the result is true, it is an off day, otherwise, it is a work day.
ja: 結果がtrueの場合は休日、そうでない場合は出勤日です。
ko: 결과가 true이면 휴일이고, 그렇지 않으면 근무일입니다.
zh_hans: 如果结果为 true 则是休息日，反之则是工作日。
zh_hk: 如果結果為 true 則是休息日，反之則是工作日。

source: Including user annotaions
ja: ユーザー注釈を含む
ko: 사용자 주석 포함
zh_hans: 包含用户标注
zh_hk: 包含用戶標註

# intent.check.offset.title
source: If it is an Off Day in n day(s)
ja: n日後が休日かどうか
ko: n일 후가 휴일인지 확인
zh_hans: 几天后是否是休息日
zh_hk: 幾日後是否是休息日

# intent.check.title
source: If a specific date is an Off Day
ja: 指定した日付が休日かどうか
ko: 특정 날짜가 휴일인지 확인
zh_hans: 指定日期是否是休息日
zh_hk: 指定日期是否是休息日

# intent.check.today.title
source: If Today is an Off Day
ja: 今日が休日かどうか
ko: 오늘이 휴일인지 확인
zh_hans: 今天是否是休息日
zh_hk: 今日是否是休息日

# intent.check.tomorrow.title
source: If Tomorrow is an Off Day
ja: 明日が休日かどうか
ko: 내일이 휴일인지 확인
zh_hans: 明天是否是休息日
zh_hk: 明日是否是休息日

# intent.clash.offset.title
source: If it is a Clash Day in n day(s)
ja: n日後が衝突日かどうか
ko: n일 후가 충돌일인지 확인
zh_hans: 几天后是否是冲突日
zh_hk: 幾日後是否是衝突日

# intent.clash.title
source: If a specific date is a Clash Day
ja: 指定した日付が衝突日かどうか
ko: 특정 날짜가 충돌일인지 확인
zh_hans: 指定日期是否是冲突日
zh_hk: 指定日期是否是衝突日

# intent.clash.today.title
source: If Today is a Clash Day
ja: 今日が衝突日かどうか
ko: 오늘이 충돌일인지 확인
zh_hans: 今天是否是冲突日
zh_hk: 今日是否是衝突日

# intent.clash.tomorrow.title
source: If Tomorrow is a Clash Day
ja: 明日が衝突日かどうか
ko: 내일이 충돌일인지 확인
zh_hans: 明天是否是冲突日
zh_hk: 明日是否是衝突日

# intent.comment.category
source: User Text Comment
ja: ユーザーテキストメモ
ko: 사용자 텍스트 메모
zh_hans: 用户文本备注
zh_hk: 用戶文本備註

# intent.comment.content
source: Content
ja: 内容
ko: 내용
zh_hans: 备注内容
zh_hk: 備註內容

# intent.comment.delete.description
source: Delete User Text Comment by Date.
ja: 日付でユーザーテキストメモを削除します。
ko: 날짜별 사용자 텍스트 메모를 삭제합니다.
zh_hans: 根据日期删除用户文本备注。
zh_hk: 根據日期刪除用戶文本備註。

# intent.comment.delete.title
source: Delete Comment
ja: メモを削除
ko: 메모 삭제
zh_hans: 删除备注
zh_hk: 刪除備註

# intent.comment.delete${date}
source: Delete Comment at ${date}
ja: ${date}のメモを削除
ko: ${date}의 메모 삭제
zh_hans: 删除${date}的备注
zh_hk: 刪除${date}的備註

# intent.comment.get.description
source: Get User Text Comment by Date, returns no value if there is no comment.
ja: 日付でユーザーテキストメモを取得します。メモがない場合は値なしを返します。
ko: 날짜별 사용자 텍스트 메모를 가져옵니다. 메모가 없으면 값을 반환하지 않습니다.
zh_hans: 根据日期获取用户文本备注，如果没有备注，返回“没有值”。
zh_hk: 根據日期獲取用戶文本備註，如果沒有備註，返回“沒有值”。

# intent.comment.get.title
source: Get Comment
ja: メモを取得
ko: 메모 가져오기
zh_hans: 获取备注
zh_hk: 獲取備註

# intent.comment.get${date}
source: Get Comment at ${date}
ja: ${date}のメモを取得
ko: ${date}의 메모 가져오기
zh_hans: 获取${date}的备注
zh_hk: 獲取${date}的備註

# intent.comment.update.description
source: Update User Text Comment by Date with specific Content. If Content is absent, will delete existing User Text Comment by Date.
ja: 日付でユーザーテキストメモを指定の内容に更新します。内容がない場合は既存のメモを削除します。
ko: 날짜별 사용자 텍스트 메모를 지정한 내용으로 업데이트합니다. 내용이 없으면 해당 날짜의 기존 사용자 텍스트 메모를 삭제합니다.
zh_hans: 根据日期更新文本备注为备注内容，如果备注内容为空，且对应日期已有文本备注，则会删除已有的文本备注。
zh_hk: 根據日期更新文本備註為備註內容，如果備註內容為空，且對應日期已有文本備註，則會刪除已有的文本備註。

# intent.comment.update.title
source: Update Comment
ja: メモを更新
ko: 메모 업데이트
zh_hans: 更新备注
zh_hk: 更新備註

# intent.comment.update${date}${content}
source: Update Comment at ${date} with ${content}
ja: ${date}のメモを${content}に更新
ko: ${date}의 메모를 ${content}(으)로 업데이트
zh_hans: 更新${date}的备注为${content}
zh_hk: 更新${date}的備註為${content}

# intent.dayDetail.baseOffValue
source: Base Calendar Off Day State
ja: ベースカレンダー休日状態
ko: 기본 캘린더 휴일 상태
zh_hans: 基础日历休息日状态
zh_hk: 基礎日曆休息日狀態

# intent.dayDetail.dateValue
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hk: 日期

# intent.dayDetail.intent.category
source: Day Detail
ja: 日付の詳細
ko: 날짜 상세 정보
zh_hans: 日期详情
zh_hk: 日期詳情

# intent.dayDetail.intent.description
source: You can get the detail of day by date.
ja: 日付で詳細を取得できます。
ko: 날짜로 상세 정보를 가져올 수 있습니다.
zh_hans: 你能根据日期获取对应日期的详情。
zh_hk: 你能根據日期獲取對應日期的詳情。

# intent.dayDetail.intent.title
source: Get Day Detail
ja: 日付の詳細を取得
ko: 날짜 상세 정보 가져오기
zh_hans: 获取日期详情
zh_hk: 獲取日期詳情

# intent.dayDetail.offValue
source: Off Day State
ja: 休日状態
ko: 휴일 상태
zh_hans: 休息日状态
zh_hk: 休息日狀態

# intent.dayDetail.publicDay
source: Public Holiday Name
ja: 祝日名
ko: 공휴일 이름
zh_hans: 公共假期名称
zh_hk: 公共假期名稱

# intent.dayDetail.publicOffValue
source: Public Holiday Template Off Day State
ja: 祝日テンプレート休日状態
ko: 공휴일 템플릿 휴일 상태
zh_hans: 公共假期模板休息日状态
zh_hk: 公共假期模板休息日狀態

# intent.dayDetail.type
source: Day Detail
ja: 日付の詳細
ko: 날짜 상세 정보
zh_hans: 日期详情
zh_hk: 日期詳情

# intent.dayDetail.userComment
source: User Text Comment
ja: ユーザーテキストメモ
ko: 사용자 텍스트 메모
zh_hans: 用户文本备注
zh_hk: 用戶文本備註

# intent.dayDetail.userOffValue
source: User Annotations Off Day State
ja: ユーザー注釈休日状態
ko: 사용자 주석 휴일 상태
zh_hans: 用户标注休息日状态
zh_hk: 用戶標註休息日狀態

# intent.dayMark.case.blank
source: Blank
ja: 空白
ko: 공백
zh_hans: 空白
zh_hk: 空白

# intent.dayMark.case.off
source: Off Day
ja: 休日
ko: 휴일
zh_hans: 休息日
zh_hk: 休息日

# intent.dayMark.case.work
source: Work Day
ja: 出勤日
ko: 근무일
zh_hans: 工作日
zh_hk: 工作日

# intent.dayMark.category
source: User Annotation
ja: ユーザー注釈
ko: 사용자 주석
zh_hans: 用户标注
zh_hk: 用戶標註

# intent.dayMark.description
source: If the result is true, the action is successful.
ja: 結果がtrueの場合、操作は成功です。
ko: 결과가 true이면 작업이 성공한 것입니다.
zh_hans: 如果结果为 true 则此项操作成功。
zh_hk: 如果結果為 true 則此項操作成功。

# intent.dayMark.parameter.title
source: User Annotation Type
ja: ユーザー注釈タイプ
ko: 사용자 주석 유형
zh_hans: 用户标注类型
zh_hk: 用戶標註類型

# intent.dayMark.title
source: Update User Annotation
ja: ユーザー注釈を更新
ko: 사용자 주석 업데이트
zh_hans: 更新用户标注
zh_hk: 更新用戶標註

# intent.dayMark.type
source: User Annotation
ja: ユーザー注釈
ko: 사용자 주석
zh_hans: 用户标注
zh_hk: 用戶標註

# intent.error.notFound
source: Not Found
ja: 見つかりません
ko: 찾을 수 없음
zh_hans: 没有找到
zh_hk: 沒有找到

# intent.error.overReach
source: The day you are querying is no longer within the validity period of the Public Holiday Template. Please update the template or update the Off Day App
ja: 照会した日付は祝日テンプレートの有効期間外です。テンプレートまたはOff Dayアプリを更新してください。
ko: 조회한 날짜는 더 이상 공휴일 템플릿의 유효 기간에 포함되지 않습니다. 템플릿을 업데이트하거나 Off Day 앱을 업데이트하세요.
zh_hans: 你查询的这一天，已经不在公共假期模板的有效期内，请更新模板或者更新休息日App。
zh_hk: 你查詢的這一日，已經不在公共假期模板的有效期內，請更新模板或者更新休息日App。

# intent.nextOffDayDetail.intent.description
source: You can get the detail of the first next Off Day by date.
ja: 日付で次の休日の詳細を取得できます。
ko: 날짜를 기준으로 다음 첫 번째 휴일의 세부 정보를 가져올 수 있습니다.
zh_hans: 你能根据日期获得下一个休息日的详情
zh_hk: 你能根據日期獲得下一個休息日的詳情

# intent.nextOffDayDetail.intent.title
source: Get Next Off Day Detail
ja: 次の休日の詳細を取得
ko: 다음 휴일 상세 정보 가져오기
zh_hans: 下一个休息日的详情
zh_hk: 下一個休息日的詳情

# intent.nextWorkDayDetail.intent.description
source: You can get the detail of the first next Work Day by date.
ja: 日付で次の出勤日の詳細を取得できます。
ko: 날짜를 기준으로 다음 첫 번째 근무일의 세부 정보를 가져올 수 있습니다.
zh_hans: 你能根据日期获得下一个工作日的详情
zh_hk: 你能根據日期獲得下一個工作日的詳情

# intent.nextWorkDayDetail.intent.title
source: Get Next Work Day Detail
ja: 次の出勤日の詳細を取得
ko: 다음 근무일 상세 정보 가져오기
zh_hans: 下一个工作日的详情
zh_hk: 下一個工作日的詳情

# intent.subscription.refresh.category
source: Subscription
ja: サブスクリプション
ko: 구독
zh_hans: 订阅
zh_hk: 訂閱

# intent.subscription.refresh.description
source: Refresh all subscribed public holiday templates
ja: 購読中の祝日テンプレートをすべて更新
ko: 구독 중인 모든 공휴일 템플릿 새로 고침
zh_hans: 刷新所有已订阅的公共假期模板
zh_hk: 刷新所有已訂閱的公共假期模板

# intent.subscription.refresh.includePaused.description
source: Whether to refresh paused subscriptions as well
ja: 一時停止中の購読も更新するか
ko: 일시 중지된 구독도 새로 고칠지 여부
zh_hans: 是否同时刷新已暂停的订阅
zh_hk: 是否同時刷新已暫停的訂閱

# intent.subscription.refresh.includePaused.title
source: Include Paused
ja: 一時停止中を含む
ko: 일시 중지 포함
zh_hans: 包含已暂停
zh_hk: 包含已暫停

# intent.subscription.refresh.summary
source: Refresh subscribed templates
ja: 購読中のテンプレートを更新
ko: 구독 중인 템플릿 새로 고침
zh_hans: 刷新已订阅的模板
zh_hk: 刷新已訂閱的模板

# intent.subscription.refresh.title
source: Refresh Subscriptions
ja: 購読を更新
ko: 구독 새로 고침
zh_hans: 刷新订阅
zh_hk: 刷新訂閱

source: Is ${date} a Clash Day?
ja: ${date}は衝突日ですか？
ko: ${date}은(는) 충돌일인가요?
zh_hans: ${date}是冲突日吗？
zh_hk: ${date}是衝突日嗎？

source: Is ${date} an Off Day?
ja: ${date}は休日ですか？
ko: ${date}은(는) 휴일인가요?
zh_hans: ${date}是休息日吗？
zh_hk: ${date}是休息日嗎？

source: Is it a Clash Day in ${dayCount} day(s)?
ja: ${dayCount}日後は衝突日ですか？
ko: ${dayCount}일 후가 충돌일인가요?
zh_hans: ${dayCount}天后是冲突日吗？
zh_hk: ${dayCount}日後是衝突日嗎？

source: Is it an Off Day in ${dayCount} day(s)?
ja: ${dayCount}日後は休日ですか？
ko: ${dayCount}일 후가 휴일인가요?
zh_hans: ${dayCount}天后是休息日吗？
zh_hk: ${dayCount}日後是休息日嗎？

source: Is Today a Clash Day?
ja: 今日は衝突日ですか？
ko: 오늘은 충돌일인가요?
zh_hans: 今天是冲突日吗？
zh_hk: 今日是衝突日嗎？

source: Is Today an Off Day?
ja: 今日は休日ですか？
ko: 오늘은 휴일인가요?
zh_hans: 今天是休息日吗？
zh_hk: 今日是休息日嗎？

source: Is Tomorrow a Clash Day?
ja: 明日は衝突日ですか？
ko: 내일은 충돌일인가요?
zh_hans: 明天是冲突日吗？
zh_hk: 明日是衝突日嗎？

source: Is Tomorrow an Off Day?
ja: 明日は休日ですか？
ko: 내일은 휴일인가요?
zh_hans: 明天是休息日吗？
zh_hk: 明日是休息日嗎？

# log.clear.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# log.clear.confirm
source: Clear
ja: クリア
ko: 지우기
zh_hans: 清空
zh_hk: 清空

# log.clear.message
source: This will permanently delete all log entries.
ja: すべてのログエントリが完全に削除されます。
ko: 모든 로그 항목이 영구적으로 삭제됩니다.
zh_hans: 此操作将永久删除所有日志条目。
zh_hk: 此操作將永久刪除所有日誌條目。

# log.clear.title
source: Clear All Logs?
ja: すべてのログを削除しますか？
ko: 모든 로그를 지울까요?
zh_hans: 确定清空全部日志？
zh_hk: 確定清空全部日誌？

# log.detail.copy
source: Copy
ja: コピー
ko: 복사
zh_hans: 复制
zh_hk: 複製

# log.detail.error
source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hk: 錯誤

# log.detail.input
source: Input
ja: 入力パラメータ
ko: 입력
zh_hans: 输入参数
zh_hk: 輸入參數

# log.detail.output
source: Output
ja: 返却結果
ko: 출력
zh_hans: 返回结果
zh_hk: 返回結果

# log.detail.output.dayTypeHint
source: Day type codes: 0 = off day, 1 = work day.
ja: 日付タイプコード：0 = 休日、1 = 出勤日。
ko: 날짜 유형 코드: 0 = 휴일, 1 = 근무일.
zh_hans: 日期类型数值：0 = 休息日，1 = 工作日。
zh_hk: 日期類型數值：0 = 休息日，1 = 工作日。

# log.detail.status
source: Status
ja: ステータス
ko: 상태
zh_hans: 状态
zh_hk: 狀態

# log.detail.timestamp
source: Timestamp
ja: 時刻
ko: 시간
zh_hans: 时间
zh_hk: 時間

# log.detail.type
source: Type
ja: タイプ
ko: 유형
zh_hans: 类型
zh_hk: 類型

# log.detail.type.subscription
source: Subscription
ja: サブスクリプション
ko: 구독
zh_hans: 订阅
zh_hk: 訂閱

# log.empty.message
source: No log entries yet. Intent calls and subscription template updates will appear here.
ja: ログはまだありません。App Intentの呼び出しや購読テンプレートの更新がここに表示されます。
ko: 아직 로그 항목이 없습니다. Intent 호출과 구독 템플릿 업데이트가 여기에 표시됩니다.
zh_hans: 暂无日志。调用快捷指令或订阅模板更新时，将会在此展示。
zh_hk: 暫無日誌。調用捷徑或訂閱模板更新時，將會在此顯示。

# log.menu.clearAll
source: Clear All Logs
ja: すべてのログを削除
ko: 모든 로그 지우기
zh_hans: 清空所有日志
zh_hk: 清空所有日誌

# log.section.earlier
source: Earlier
ja: それ以前
ko: 이전
zh_hans: 更早
zh_hk: 更早

# log.section.thisWeek
source: Past 7 Days
ja: 過去7日間
ko: 지난 7일
zh_hans: 近 7 天
zh_hk: 近 7 天

# log.section.today
source: Today
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hk: 今天

# log.section.yesterday
source: Yesterday
ja: 昨日
ko: 어제
zh_hans: 昨天
zh_hk: 昨天

# log.status.failure
source: Failure
ja: 失敗
ko: 실패
zh_hans: 失败
zh_hk: 失敗

# log.status.success
source: Success
ja: 成功
ko: 성공
zh_hans: 成功
zh_hk: 成功

# log.subscription.accept
source: Accept Update
ja: 更新を適用
ko: 업데이트 적용
zh_hans: 接受更新
zh_hk: 接受更新

# log.subscription.pause
source: Pause
ja: 一時停止
ko: 일시 중지
zh_hans: 暂停
zh_hk: 暫停

# log.subscription.refresh
source: Refresh
ja: 更新
ko: 새로 고침
zh_hans: 刷新
zh_hk: 刷新

# log.subscription.reject
source: Reject Update
ja: 更新を拒否
ko: 업데이트 거부
zh_hans: 拒绝更新
zh_hk: 拒絕更新

# log.subscription.resume
source: Resume
ja: 再開
ko: 재개
zh_hans: 恢复
zh_hk: 恢復

# log.subscription.subscribe
source: Subscribe
ja: 購読
ko: 구독
zh_hans: 订阅
zh_hk: 訂閱

# log.subscription.trigger.background
source: Background
ja: バックグラウンド
ko: 백그라운드
zh_hans: 后台
zh_hk: 背景

# log.subscription.trigger.intent
source: Shortcut
ja: ショートカット
ko: 단축어
zh_hans: 快捷指令
zh_hk: 捷徑

# log.subscription.trigger.launch
source: User Launch
ja: ユーザー起動
ko: 사용자 실행
zh_hans: 用户启动
zh_hk: 用戶啟動

# log.subscription.trigger.manual
source: Manual
ja: 手動
ko: 수동
zh_hans: 手动
zh_hk: 手動

# log.summary.metadataChanges
source: metadata: %@
ja: メタデータ：%@
ko: 메타데이터: %@
zh_hans: 元数据：%@
zh_hk: 元資料：%@

# log.summary.noChanges
source: No changes
ja: 変更なし
ko: 변경 없음
zh_hans: 无变更
zh_hk: 無變更

# logo.classic.name
source: Classic
ja: クラシック
ko: 클래식
zh_hans: 经典
zh_hk: 經典

# logo.glass.name
source: Default
ja: デフォルト
ko: 기본값
zh_hans: 默认
zh_hk: 默認

# more.item.contact.email
source: Email
ja: メール
ko: 이메일
zh_hans: 邮箱
zh_hk: 郵箱

# more.item.help
source: User Manual
ja: 使い方
ko: 사용자 설명서
zh_hans: 使用说明
zh_hk: 使用說明

# more.item.settings.baseCalendar
source: Base Calendar
ja: ベースカレンダー
ko: 기본 캘린더
zh_hans: 基础日历
zh_hk: 基礎日曆

# more.item.settings.publicPlan
source: Public Holiday Template
ja: 祝日テンプレート
ko: 공휴일 템플릿
zh_hans: 公共假期模板
zh_hk: 公共假期模板

# more.item.settings.publicPlan.noSet
source: No Template
ja: テンプレートなし
ko: 템플릿 없음
zh_hans: 无
zh_hk: 無

# more.section.contact
source: Contact Developer
ja: 開発者に連絡
ko: 개발자에게 문의
zh_hans: 联络开发者
zh_hk: 聯絡開發者

# more.section.contact.hint
source: Got ideas? Tell us!
ja: ご意見・ご要望はこちらへ！
ko: 아이디어가 있나요? 알려주세요!
zh_hans: 有想法？快和我们说！
zh_hk: 有想法？快和我们说！

# more.section.dataSource
source: Data Source
ja: データソース
ko: 데이터 소스
zh_hans: 数据源
zh_hk: 數據源

# more.section.general
source: General
ja: 一般
ko: 일반
zh_hans: 通用
zh_hk: 一般

# more.section.help.hint
source: For more details
ja: 詳細はこちら
ko: 자세한 내용
zh_hans: 更多细节
zh_hk: 更多細節
